{
    "title": "This is a title for a blog post",
    "post_type": "book",
    "content": {
        "overall": "This is going to be a truly touchy review to give. Reading Tara Westover's story was an emotional journey. Tara grew up in a Mormon family under a Father who although in his own way wished her all the best in her life, ended up creating an incredibly adverse environment for Tara to grow up in. She didn't go to school, she didn't get a birth certificate until she was 9 years old and went through challenges that most people won't be able to fathom. \r\n\r\nI didn't expect to identify with Tara's journey as much as I did. I grew up in a Muslim country. Where my dad (Who I love more than anyone in this world) was afraid of the typical life one would live in A First World country. He is a man of religion, he is driven by the ideal world where his children would be the same. This has led to tremendous challenges in University, in my attempts to understand why people lived the way they did. \"If only they knew what is to come to them after they die\". I went through a similar paradigm shift that Tara did, although my family was never abusive and has always been supportive. I grew up believing one thing, only to realize the world is way more than just how I thought about it. It isn't that simple, the world we live in is complex, people have different beliefs and we have to at least have the audacity to respect their opinions, and the independence to form our own.\r\n\r\nWhat is it that defines us? I have always had an underlying belief that we are the sum total of our experiences ever since we were born (Plus what we get from DNA, I, however, refuse to believe genetics defines us, it only sets the environment we were born into, much like the chances that we would be born in a third world country suffering from the world's largest famine. It can be overcome) Was Tara curious about History because of the misinformation growing up? Was she driven because she was taught hard labor at a young age? Did she achieve what she did because she had lived a life where she had nothing, so she appreciated it all?. All those questions I could translate to questions to myself, and this is by far the most I have ever identified with a memoir. I survived an airstrike at 17, I was already asking the question of what have I achieved in life? Did I truly deserve to live, when the person next door didn't? Those questions drive me. Until recently, whenever I fail, I would always remember that scared 17 years old, with glass shattering on top of him, who can hear the explosive shards louder and his own thoughts, who thought that any one of those seconds would be his last, did he deserve to live only to fail? I'm lucky to have overcome that thought process and to have understood to have gratitude and learn from my failures rather than blaming myself. Reading about Tara and her incredible story gave me inspiration, it solidified my beliefs in education, personal education, forming my own views, fighting for what I believe in and be willing to lose that fight if I am convinced.\r\n\r\nThank you Tara, you gave this lost kid a role model to relate to. May our hardships guide us towards a path of education and gratitude.\r\n",
        "like" : "This is an example of a what I liked section in  abook review",
        "not_like": "This is an example of what I didn't like section in a book review",
        "rating" : 5,
        "rating_desc": "This is an example justifying my rating"
    },
    "date": "14/20/2019"
}